api-rails/app/controllers/documents_controller.rb

    def index
        documents = Document.where(:confidential => false)
---
SELECT "documents".* FROM "documents" WHERE "documents"."confidential" = $1  [["confidential", 0]]

    def create
        document = Document.new(document_params)
        document.user = current_user
        if document.save
---
INSERT INTO "documents" ("file", "notes", "confidential", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["file", "Document test"], ["notes", "Description of document"], ["confidential", 0], ["user_id", 1], ["created_at", "2019-01-15 02:08:53.387547"], ["updated_at", "2019-01-15 02:08:53.387547"]]